Repository: okfn/ckanext-iati-generator
Catalog: ckanext/iati_generator/i18n/*/LC_MESSAGES/ckanext-iati-generator.po
Languages: es

source: No organization IATI files of type %(file_type)s found.
es: No se encontraron archivos IATI de organización del tipo %(file_type)s.

source: Expected no more than %(max_files)s organization IATI file(s) of type %(file_type)s, found %(count)s.
es: Se esperaban no más de %(max_files)s archivo(s) IATI de organización del tipo %(file_type)s, se encontraron %(count)s.

source: Required CSV file missing
es: Falta el archivo CSV requerido

source: %(csv_file)s was not found in the build folder.
es: No se encontró %(csv_file)s en la carpeta de construcción.

source: Upload %(csv_file)s as a dataset resource (with the correct IATI file type) and try again.
es: Sube %(csv_file)s como un recurso de conjunto de datos (con el tipo de archivo IATI correcto) y vuelve a intentarlo.

source: The XML could not be generated because required CSV files are missing or malformed.
es: No se pudo generar el XML porque faltan o están mal formados los archivos CSV requeridos.

source: The schema expected <%(expected_first)s> before <%(element)s>. Check that %(expected_csv)s exists and contains valid data for these activities.
es: El esquema esperaba <%(expected_first)s> antes de <%(element)s>. Verifica que %(expected_csv)s exista y contenga datos válidos para estas actividades.

source: The schema expected <%(expected_first)s> before <%(element)s>. Check the CSV files that generate those elements.
es: El esquema esperaba <%(expected_first)s> antes de <%(element)s>. Verifica los archivos CSV que generan esos elementos.

source: The order/structure of the XML does not match the schema. Check the related CSV files for '%(element)s' and the expected elements: (%(expected)s).
es: El orden/estructura del XML no coincide con el esquema. Verifica los archivos CSV relacionados para '%(element)s' y los elementos esperados: (%(expected)s).

source: Element out of order
es: Elemento fuera de orden

source: Missing required elements
es: Faltan elementos requeridos

source: Missing required child elements within '%(element)s'. Check that the CSV files generating (%(expected)s) exist and contain valid rows.
es: Faltan elementos requeridos dentro de '%(element)s'. Verifica que los archivos CSV generando (%(expected)s) existan y contengan filas válidas.

source: Invalid value
es: Valor inválido

source: The value '%(value)s' does not match the expected format for '%(element)s'.
es: El valor '%(value)s' no coincide con el formato esperado para '%(element)s'.

source: Invalid code
es: Código inválido

source: The value '%(value)s' is not allowed for '%(element)s'. Check the valid codes.
es: El valor '%(value)s' no está permitido para '%(element)s'. Verifica los códigos válidos.

source: Invalid data type
es: Tipo de dato inválido

source: The value '%(value)s' is not of the correct type for '%(element)s'.
es: El valor '%(value)s' no es del tipo correcto para '%(element)s'.

source: Check the required CSV files and their format.
es: Verifica los archivos CSV requeridos y su formato.

source: The XML could not be generated due to errors in the source CSV files.
es: No se pudo generar el XML debido a errores en los archivos CSV fuente.

source: The XML could not be generated due to validation errors in the source CSV files.
es: No se pudo generar el XML debido a errores de validación en los archivos CSV fuente.

source: Only organization admins (or sysadmins) can perform this action.
es: Solo los administradores de organización (o administradores del sistema) pueden realizar esta acción.

source: Missing or invalid resource_id; cannot resolve dataset for IATI file creation.
es: Falta o es inválido el resource_id; no se puede resolver el conjunto de datos para la creación del archivo IATI.

source: Cannot resolve dataset for IATI file update (need valid id or resource_id).
es: No se puede resolver el conjunto de datos para la actualización del archivo IATI (se necesita un id o resource_id válido).

source: Cannot resolve dataset for IATI file deletion (need valid id or resource_id).
es: No se puede resolver el conjunto de datos para la eliminación del archivo IATI (se necesita un id o resource_id válido).

source: Error processing validation errors
es: Error al procesar errores de validación

source: Contact support
es: Contactar soporte

source: There was an error generating the IATI file probably due to missing on wrong-formatted files.
es: Hubo un error al generar el archivo IATI, probablemente debido a archivos faltantes o con formato incorrecto.

source: The dataset does not exist
es: El conjunto de datos no existe

source: IATI Compilation Errors
es: Errores al compilar IATI

source: Back to IATI files
es: Volver a archivos IATI

source: Errors
es: Errores

source: Technical details (for support)
es: Detalles técnicos (para soporte)

source: IATI File Compilation Errors
es: Errores al compilar archivo IATI

source: The IATI file was not overwritten due to errors in the source files. Please review the errors listed above and correct the corresponding files before attempting to generate the IATI file again.
es: No se ha sobreescrito el archivo IATI debido a errores en los archivos fuente. Por favor, revise los errores listados arriba y corrija los archivos correspondientes antes de intentar generar el archivo IATI nuevamente.

source: IATI files
es: Archivos IATI

source: Files missing for organisation.xml file
es: Archivos faltantes para el archivo organisation.xml

source: Files missing for activity.xml file
es: Archivos faltantes para el archivo activity.xml

source: This dataset contains all the required files to generate the activity.xml file.
es: Este conjunto de datos contiene todos los archivos requeridos para generar el archivo activity.xml.

source: Generate activity.xml
es: Generar activity.xml

source: This dataset contains all the required files to generate the organisation.xml file.
es: Este conjunto de datos contiene todos los archivos requeridos para generar el archivo organisation.xml.

source: Generate organisation.xml
es: Generar organisation.xml

source: Activity Files
es: Archivos de Actividades

source: File type
es: Tipo de archivo

source: Resource
es: Recurso

source: Organization Files
es: Archivos de Organización

source: Getting Started
es: Primeros pasos

source: Create a dataset and fill the namespace value (so it gets identified as an IATI file)
es: Cree un conjunto de datos y complete el valor del espacio de nombres (para que se identifique como un archivo IATI)

source: For each IATI CSV file you have, create a resource on the dataset and upload the file to it.
es: Para cada archivo CSV IATI que tenga, cree un recurso en el conjunto de datos y suba el archivo a él.

source: To each created resource, assign the corresponding IATI file type (it will be available in the resource form).
es: A cada recurso creado, asigne el tipo de archivo IATI correspondiente (estará disponible en el formulario del recurso).

source: Once all mandatory files exist, XML generation will be enabled on this page.
es: Una vez que existan todos los archivos obligatorios, se habilitará la generación de XML en esta página.

source: About IATI
es: Acerca de IATI

source: IATI (International Aid Transparency Initiative) is a global standard for publishing data on development and humanitarian resources.
es: IATI (Iniciativa Internacional para la Transparencia de la Ayuda) es un estándar global para publicar datos sobre recursos de desarrollo y humanitarios.

source: This page lists the IATI files configured on resources. It shows whether each file is currently valid, and the date/message of the last validation run.
es: Esta página lista los archivos IATI configurados en los recursos. Muestra si cada archivo es válido actualmente, y la fecha/mensaje de la última ejecución de validación.

source: You can view the IATI documentation at the following link:
es: Puede ver la documentación de IATI en el siguiente enlace:

source: OKFN IATI library:
es: Biblioteca IATI de OKFN:

source: Public IATI links
es: Enlaces públicos de la IATI

source: Link copied!
es: Enlace copiado!!

source: IATI Files
es: Archivos IATI
